# Demo 01 - Sakila Star Schema & ETL

In [3]:
!PGPASSWORD=5 createdb -h 127.0.0.1 -U postgres pagila
!PGPASSWORD=5 psql -q -h 127.0.0.1 -U postgres -d pagila -f Data/pagila-schema.sql
!PGPASSWORD=5 psql -q -h 127.0.0.1 -U postgres -d pagila -f Data/pagila-data.sql

createdb: error: database creation failed: ERROR:  database "pagila" already exists
 set_config
------------

(1 row)

 set_config
------------

(1 row)

 setval
--------
    200
(1 row)

 setval
--------
    605
(1 row)

 setval
--------
     16
(1 row)

 setval
--------
    600
(1 row)

 setval
--------
    109
(1 row)

 setval
--------
    599
(1 row)

 setval
--------
   1000
(1 row)

 setval
--------
   4581
(1 row)

 setval
--------
      6
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
      2
(1 row)

 setval
--------
      2
(1 row)

In [7]:
%load_ext sql

In [8]:
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'postgres'
DB_PASSWORD = '5'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://postgres:5@127.0.0.1:5432/pagila

In [10]:


%sql $conn_string

In [11]:
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;

print("nFilms\t\t=", nFilms[0][0])
print("nCustomers\t=", nCustomers[0][0])
print("nRentals\t=", nRentals[0][0])
print("nPayment\t=", nPayment[0][0])
print("nStaff\t\t=", nStaff[0][0])
print("nStores\t\t=", nStores[0][0])
print("nCities\t\t=", nCity[0][0])
print("nCountry\t\t=", nCountry[0][0])

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
nFilms		= 1000
nCustomers	= 599
nRentals	= 16044
nPayment	= 16049
nStaff		= 2
nStores		= 2
nCities		= 600
nCountry		= 109

In [12]:


%%sql 
select min(payment_date) as start, max(payment_date) as end from payment;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.

[(datetime.datetime(2020, 1, 25, 0, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), datetime.datetime(2020, 5, 14, 15, 44, 29, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)))]

In [14]:
%%sql
select district,  count(city_id) as n
from address
group by district
order by n desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Buenos Aires', 10),
 ('Shandong', 9),
 ('California', 9),
 ('West Bengali', 9),
 ('Uttar Pradesh', 8),
 ('So Paulo', 8),
 ('England', 7),
 ('Maharashtra', 7),
 ('Southern Tagalog', 6),
 ('Gois', 5)]

In [15]:
%%sql
select film_id, title, release_year, rental_rate, rating  from film limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2006, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2006, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2006, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2006, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2006, Decimal('2.99'), 'G')]

In [16]:
%%sql
select * from payment limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2020, 1, 25, 0, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None))),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2020, 1, 25, 18, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None))),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2020, 1, 29, 0, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None))),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2020, 1, 29, 3, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None))),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2020, 1, 29, 11, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)))]

In [17]:
%%sql
select * from inventory limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2020, 2, 15, 13, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None))),
 (2, 1, 1, datetime.datetime(2020, 2, 15, 13, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None))),
 (3, 1, 1, datetime.datetime(2020, 2, 15, 13, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None))),
 (4, 1, 1, datetime.datetime(2020, 2, 15, 13, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None))),
 (5, 1, 2, datetime.datetime(2020, 2, 15, 13, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)))]

In [18]:
%%sql
SELECT f.title, p.amount, p.payment_date, p.customer_id                                            
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[('SWARM GOLD', Decimal('1.99'), datetime.datetime(2020, 1, 25, 0, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 269),
 ('PACKER MADIGAN', Decimal('0.99'), datetime.datetime(2020, 1, 25, 18, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 269),
 ('SOMETHING DUCK', Decimal('6.99'), datetime.datetime(2020, 1, 29, 0, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 269),
 ('DRACULA CRYSTAL', Decimal('0.99'), datetime.datetime(2020, 1, 29, 3, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 269),
 ('CLOSER BANG', Decimal('4.99'), datetime.datetime(2020, 1, 29, 11, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 269)]

In [19]:
%%sql
SELECT f.title, sum(p.amount) as revenue                                            
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
GROUP BY title
ORDER BY revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72')),
 ('TITANS JERK', Decimal('201.71')),
 ('TORQUE BOUND', Decimal('198.72')),
 ('HARRY IDAHO', Decimal('195.70')),
 ('INNOCENT USUAL', Decimal('191.74')),
 ('HUSTLER PARTY', Decimal('190.78'))]

In [20]:
%%sql
SELECT p.customer_id, p.rental_id, p.amount, ci.city                            
FROM payment p
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
order by p.payment_date
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[(130, 1, Decimal('2.99'), 'guas Lindas de Gois'),
 (459, 2, Decimal('2.99'), 'Qomsheh'),
 (408, 3, Decimal('3.99'), 'Jaffna'),
 (333, 4, Decimal('4.99'), 'Baku'),
 (222, 5, Decimal('6.99'), 'Jaroslavl'),
 (549, 6, Decimal('0.99'), 'Santiago de Compostela'),
 (269, 7, Decimal('1.99'), 'Salinas'),
 (239, 8, Decimal('4.99'), 'Ciomas'),
 (126, 9, Decimal('4.99'), 'Po'),
 (399, 10, Decimal('5.99'), 'Okara')]

In [21]:
%%sql
SELECT ci.city ,  sum(p.amount) as revenue
FROM payment p
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by ci.city
order by revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('194.61')),
 ('Qomsheh', Decimal('186.62')),
 ('London', Decimal('180.52')),
 ('Ourense (Orense)', Decimal('177.60')),
 ('Bijapur', Decimal('175.61'))]

In [22]:
%%sql
SELECT sum(p.amount) as revenue, EXTRACT(month FROM p.payment_date) as month
from payment p
group by month
order by revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(Decimal('28094.52'), 4.0),
 (Decimal('23886.56'), 3.0),
 (Decimal('9633.86'), 2.0),
 (Decimal('4822.45'), 1.0),
 (Decimal('979.12'), 5.0)]

In [23]:
%%sql
SELECT f.title, p.amount, p.customer_id, ci.city, p.payment_date,EXTRACT(month FROM p.payment_date) as month
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
order by p.payment_date
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('BLANKET BEVERLY', Decimal('2.99'), 130, 'guas Lindas de Gois', datetime.datetime(2020, 1, 25, 0, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 1.0),
 ('FREAKY POCUS', Decimal('2.99'), 459, 'Qomsheh', datetime.datetime(2020, 1, 25, 0, 22, 59, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 1.0),
 ('GRADUATE LORD', Decimal('3.99'), 408, 'Jaffna', datetime.datetime(2020, 1, 25, 0, 32, 5, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 1.0),
 ('LOVE SUICIDES', Decimal('4.99'), 333, 'Baku', datetime.datetime(2020, 1, 25, 0, 33, 7, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 1.0),
 ('IDOLS SNATCHERS', Decimal('6.99'), 222, 'Jaroslavl', datetime.datetime(2020, 1, 25, 0, 33, 47, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 1.0),
 ('MYSTIC TRUMAN', Decimal('0.99'), 549, 'Santiago de Compostela', datetime.datetime(2020, 1, 25, 0, 36, 33, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 1.0),
 ('SWARM GOLD', Decimal('1.99'), 269, 'Salinas', datetime.datetime(2020, 1, 25, 0, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 1.0),
 ('LAWLESS VISION', Decimal('4.99'), 239, 'Ciomas', datetime.datetime(2020, 1, 25, 1, 0, 12, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 1.0),
 ('MATRIX SNOWMAN', Decimal('4.99'), 126, 'Po', datetime.datetime(2020, 1, 25, 1, 29, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 1.0),
 ('HANGING DEEP', Decimal('5.99'), 399, 'Okara', datetime.datetime(2020, 1, 25, 1, 30, 47, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=180, name=None)), 1.0)]